src/Catalogs/Сделки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Сделки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСделки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыСделок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Врач</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВходящийНомерТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗавершенияСделки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСделки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Заявки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникИнформации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РекламныеИсточники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникИнформацииЗначение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаналПривлечения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КаналыПривлечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаналПривлеченияЗначение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Мессенджеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСинхронизации</Name>
					<Comment>Необходим для конвертации бизнес-процессов в сделки</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсЛечения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КурсыЛечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Лечение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеСокращенное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланЛечения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПланЛечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредыдущийПрием</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрефиксСинхронизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Прием</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОтказа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныОтказов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатСделки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РезультатыСделок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Специализация</Name>
					<Comment>Специализация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Специализации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусПациента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаСделки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтапОтказа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭтапыСделок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтапСделки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭтапыСделок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтапУспеха</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭтапыСделок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИсторияИзмененияЭтапов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПереходСЭтапа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЭтапыСделок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПереходНаЭтап</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЭтапыСделок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Автор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/Сделки/Forms/ФормаИзменить/Ext/Form/Module.bsl
#Область _____ОБРАБОТЧИКИ_СОБЫТИЙ_ФОРМЫ_____

&НаСервере
// Процедура, обработчик события ПриСозданииНаСервере.
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	ЗаполнениеЭлементовФормы();
	УстановитьВидмостьВсплывающейГруппы(ЭтотОбъект.Действие);
	 
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события ПриЗакрытии.
//
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	// Задаем параметры закрытия формы.
	ПараметрыЗакрытияФормы = Новый Структура;
	ПараметрыЗакрытияФормы.Вставить("Действие", ЭтотОбъект.Действие);
	
	// Закрытие формы.
	Закрыть(ПараметрыЗакрытияФормы);
	
КонецПроцедуры

#КонецОбласти

#Область _ОБРАБОТЧИКИ_СОБЫТИЙ_ЭЛЕМЕНТОВ_ФОРМЫ_

&НаКлиенте
// Процедура, обработчик события "ОбработкаВыбора".
//
Процедура ДействиеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	// Устанавливается видимость элементов Формы.
	УстановитьВидмостьВсплывающейГруппы(ВыбранноеЗначение);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриИзменении".
//
Процедура ВидСделкиВыборПриИзменении(Элемент)
	
	Элементы.ЭтапСделки.Доступность = ЗначениеЗаполнено(ВидСделки);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ОбработкаВыбора".
//
Процедура ВидСделкиВыборОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		
		Элементы.ЭтапСделки.Доступность = Истина;
		
		ЭтотОбъект.ЗначениеДействия = ПредопределенноеЗначение("Справочник.ЭтапыСделок.ПустаяСсылка");
		ЭтапыСделок = ПолучтьЭтапыПоВидуСделкиСервер(ВыбранноеЗначение);
		Элементы.ЭтапСделки.СписокВыбора.ЗагрузитьЗначения(ЭтапыСделок);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды "ДействияДобавить".
//
Процедура ДействияДобавить(Команда)
	
	//УдалитьПустыеСтрокиСотрудников();
	НоваяСтрока = ЭтотОбъект.ТаблицаДействия.Добавить();	
	Элементы.ТаблицаДействия.ТекущаяСтрока = ЭтотОбъект.ТаблицаДействия.Индекс(НоваяСтрока);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды "ДействияУдалить".
//
Процедура ДействияУдалить(Команда)
	
	ТекущиеДанные = Элементы.ТаблицаДействия.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		
		ЭтотОбъект.ТаблицаДействия.Удалить(ТекущиеДанные);
		ЗаполнитьПроцентомСтрокиТЗ();

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команд "ПрименитьКВыделенным" и "ПрименитьКоВсем".
//
Процедура Применить(Команда)
	
	// Задаем параметры закрытия формы.
	ПараметрыЗакрытияФормы = ПолучениеПараметровЗакрытияФормы(Новый Структура);
	ПараметрыЗакрытияФормы.Вставить("ИмяВыбраннойКоманды", Команда.Имя);

	// Закрытие формы.
	Закрыть(ПараметрыЗакрытияФормы);
	
КонецПроцедуры

&НаКлиенте
Функция ПолучениеПараметровЗакрытияФормы(ПараметрыЗакрытияФормы)
		
	ПараметрыЗакрытияФормы.Вставить("Действие"			 , ЭтотОбъект.Действие);
	
	Если ЭтотОбъект.Действие = "Менеджера" Тогда
		
		ПараметрыЗакрытияФормы.Вставить("ЗаменитьМенеджера"	 , ЭтотОбъект.ЗаменитьМенеджераПоПродажамВКлиенте);
		ПараметрыЗакрытияФормы.Вставить("ЗаменитьИсполнителя", ЭтотОбъект.ЗаменитьИсполнителяВНеЗавершенныхЗадачах);
		ПараметрыЗакрытияФормы.Вставить("ДанныеДействия"	 , ПолучениеТаблицыДействия());
		
	ИначеЕсли ЭтотОбъект.Действие = "РекламныйИсточник" ИЛИ ЭтотОбъект.Действие = "КаналПривлечения" Тогда
		
		ПараметрыЗакрытияФормы.Вставить("ЗначениеДействия"	 , ЭтотОбъект.ЗначениеДействия);
		
	ИначеЕсли ЭтотОбъект.Действие = "ВидСделки" Тогда
		
		ПараметрыЗакрытияФормы.Вставить("ВидСделкиВыбор"	 , ЭтотОбъект.ВидСделки);
		ПараметрыЗакрытияФормы.Вставить("Этап"				 , ЭтотОбъект.ЗначениеДействия);
		
	КонецЕсли;
	
	Возврат ПараметрыЗакрытияФормы;

КонецФункции

&НаСервере
// Функция, получение данных из ТаблицаДействия.
//
Функция ПолучениеТаблицыДействия()
		
	Возврат ПоместитьВоВременноеХранилище(ТаблицаДействия.Выгрузить(), Новый УникальныйИдентификатор); 
	
КонецФункции

&НаКлиенте
// Процедура, обработчик события "ПередОкончаниемРедактирования".
//
Процедура ТаблицаДействияПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	УдалитьПустыеСтрокиСотрудников();
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПослеУдаления".
//
Процедура ТаблицаДействияПослеУдаления(Элемент)
	
	УдалитьПустыеСтрокиСотрудников();
	ЗаполнитьПроцентомСтрокиТЗ();
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриИзменении".
//
Процедура ТаблицаДействияПроцентПриИзменении(Элемент)
	
	СуммаПроцентов   = ЭтотОбъект.ТаблицаДействия.Итог("Пропорция");
	ОстатокПроцентов = 100 - СуммаПроцентов;
		
	ЭтотОбъект.ОстаточныйПроцентОтДеления 	  = ОстатокПроцентов;	
	Элементы.ОстаточныйПроцент.Видимость 	  = ОстатокПроцентов <> 0;		
	Элементы.ГруппаПрименитьОбщая.Доступность = ОстатокПроцентов = 0;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриИзменении".
//
Процедура ТаблицаДействияСотрудникПриИзменении(Элемент)
	
	ЗаполнитьПроцентомСтрокиТЗ();
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработка события "ОбработкаВыбора".
//
Процедура ТаблицаДействияСотрудникОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	МассивСтрок = ЭтотОбъект.ТаблицаДействия.НайтиСтроки(Новый Структура("Сотрудник", ВыбранноеЗначение));
	Если МассивСтрок.Количество() > 0 Тогда
		СтандартнаяОбработка = Ложь;
		ПоказатьПредупреждение(, НСтр("ru='Этот сотрудник уже есть в списке.';en='This employee already there is in the list.'"));
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область _СЛУЖЕБНЫЕ_ПРОЦЕДУРЫ_И_ФУНКЦИИ_

&НаСервере
// Процедура, заполняет элементы формы из параметров открытия формы.
Процедура ЗаполнениеЭлементовФормы()
	
	Если Параметры.Свойство("Действие") Тогда
		ЭтотОбъект.Действие = Параметры.Действие;
	КонецЕсли;
	
	Если Параметры.Свойство("ВыделенныеЭлементы") Тогда
		Элементы.ПрименитьКВыделенным.Заголовок = НСтр("ru = 'Применить к выделенным ('; en = 'Apply to selected ('") + Параметры.ВыделенныеЭлементы + ")"; 
	КонецЕсли;
	
	Если Параметры.Свойство("Количество") Тогда
		Элементы.ПрименитьКоВсем.Заголовок = НСтр("ru = 'Применить ко всем ('; en = 'Apply to all ('") + Параметры.Количество+ ")";
	КонецЕсли;
	
	Если ЭтотОбъект.Действие = "Менеджера" Тогда
		
		// Заполнение таблицы значений ТаблицаДействия.
		Если Параметры.Свойство("ДанныеДействия") Тогда
			ДанныеДействия = ПолучитьИзВременногоХранилища(Параметры.ДанныеДействия);
			
			Для каждого СтрокаТЗ из ДанныеДействия Цикл
				ЗаполнитьЗначенияСвойств(ТаблицаДействия.Добавить(), СтрокаТЗ) 
			КонецЦикла;
			
			ЗаполнитьПроцентомСтрокиТЗ();
		КонецЕсли;
		
		// Установка параметра ЗаменитьМенеджераПоПродажамВКлиенте.
		Если Параметры.Свойство("ЗаменитьМенеджера") Тогда
			ЭтотОбъект.ЗаменитьМенеджераПоПродажамВКлиенте = Параметры.ЗаменитьМенеджера;
		КонецЕсли;
		
		// Установка параметра ЗаменитьИсполнителяВНеЗавершенныхЗадачах.
		Если Параметры.Свойство("ЗаменитьИсполнителя") Тогда
			ЭтотОбъект.ЗаменитьИсполнителяВНеЗавершенныхЗадачах = Параметры.ЗаменитьИсполнителя;
		КонецЕсли; 
		
	ИначеЕсли Параметры.Действие = "РекламныйИсточник" ИЛИ Параметры.Действие = "КаналПривлечения" Тогда
		
		// Заполнение поля ЗначениеДействия. 
		Если Параметры.Свойство("ЗначениеДействия") Тогда
			ЭтотОбъект.ЗначениеДействия = Параметры.ЗначениеДействия;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура, устанавливает видимость групп и элементов.
//
Процедура УстановитьВидмостьВсплывающейГруппы(Знач ВыбранноеЗначение)
	
	ЭтотОбъект.ВидСделки 		= Неопределено;
	ЭтотОбъект.ЗначениеДействия = Неопределено;
	
	Если ВыбранноеЗначение = "Менеджера" Тогда
		
		ВидимостьТаблицыДействий(ВыбранноеЗначение);
				
	ИначеЕсли ВыбранноеЗначение = "РекламныйИсточник" Тогда
		
		ЭтотОбъект.ЗначениеДействия = ПредопределенноеЗначение("Справочник.РекламныеИсточники.ПустаяСсылка");		
		ВидимостьТаблицыДействий(ВыбранноеЗначение);
		
	ИначеЕсли ВыбранноеЗначение = "КаналПривлечения" Тогда
		
		ЭтотОбъект.ЗначениеДействия = ПредопределенноеЗначение("Справочник.КаналыПривлечения.ПустаяСсылка");		
		ВидимостьТаблицыДействий(ВыбранноеЗначение);
		
	ИначеЕсли ВыбранноеЗначение = "ВидСделки" Тогда
		
		ВидимостьТаблицыДействий(ВыбранноеЗначение);
		Элементы.ЭтапСделки.Доступность 	 = Ложь;
		Элементы.ГруппаВидСделки.Видимость 	 = Истина;
		Элементы.ГруппаПодДействия.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура, ЗаполнитьПроцентомСтрокиТЗ.
//
// Описание:
//
//
// Параметры (название, тип, дифференцированное значение)
//
Процедура ЗаполнитьПроцентомСтрокиТЗ()
	
	Элементы.ОстаточныйПроцент.Видимость = Ложь;
	
	КолвоЭлементов = ЭтотОбъект.ТаблицаДействия.Количество();
	
	Если КолвоЭлементов > 0 Тогда
		
		Процентов  		   = Цел(100 / КолвоЭлементов);
		НедостающийПроцент = 100 - (Процентов * КолвоЭлементов);
		
		Для Каждого СтрокаТЗ Из ЭтотОбъект.ТаблицаДействия Цикл
			СтрокаТЗ.Пропорция = Процентов;
		КонецЦикла;
		
		ЭтотОбъект.ОстаточныйПроцентОтДеления = НедостающийПроцент;
		Элементы.ОстаточныйПроцент.Видимость  = НедостающийПроцент > 0;
		Элементы.ГруппаПрименитьОбщая.Доступность = НедостающийПроцент = 0;
		
	Иначе
		Элементы.ГруппаПрименитьОбщая.Доступность = Ложь;	
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция, возвращает этапы по виду сделки.
//
Функция ПолучтьЭтапыПоВидуСделкиСервер(ВидСделки)
	
	Возврат Справочники.ВидыСделок.ПолучитьЭтапыПоВидуСделки(ВидСделки).ВыгрузитьКолонку("ЭтапСделки");
	
КонецФункции 

&НаСервере
// Процедура, устанавливает видимость таблицы действий.
//
Процедура ВидимостьТаблицыДействий(Знач ВыбранноеЗначение)
	
	Элементы.ГруппаВидСделки.Видимость = Ложь;
	
	Если ВыбранноеЗначение = "Менеджера" Тогда
		
		Элементы.ГруппаПодДействийГоризонталь.Видимость = Ложь;
		Элементы.ГруппаПодДействия.Видимость 	   		= Ложь;
		Элементы.ГруппаКнопокДействия.Видимость   		= Истина;
		Элементы.ТаблицаДействия.Видимость		   		= Истина;
		Элементы.ЗаглушкаДействие.Видимость 	   		= Истина;
		Элементы.ГруппаЗаменитьМенеджера.Видимость 		= Истина;
		Элементы.ГруппаПрименитьОбщая.Доступность  		= ЗначениеЗаполнено(ЭтотОбъект.ТаблицаДействия);
		
	Иначе
		Элементы.ГруппаПодДействийГоризонталь.Видимость = Истина;
		Элементы.ГруппаКнопокДействия.Видимость   		= Ложь;
		Элементы.ТаблицаДействия.Видимость		  		= Ложь;
		Элементы.ЗаглушкаДействие.Видимость 	   		= Ложь;
		Элементы.ГруппаЗаменитьМенеджера.Видимость		= Ложь;
		Элементы.ГруппаПрименитьОбщая.Доступность  		= Истина;
		Элементы.ГруппаВыборДействия.Высота 			= 3;
		Элементы.ГруппаПодДействия.Видимость 	   		= Истина;
					
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Процедура, УдалитьПустыеСтрокиСотрудников.
//
Процедура УдалитьПустыеСтрокиСотрудников()
	
	МассивПустыхСтрок = ЭтотОбъект.ТаблицаДействия.НайтиСтроки(Новый Структура("Сотрудник", ПредопределенноеЗначение("Справочник.Сотрудники.ПустаяСсылка")));
	Для Каждого СтрокаМассива Из МассивПустыхСтрок Цикл		
		ЭтотОбъект.ТаблицаДействия.Удалить(ЭтотОбъект.ТаблицаДействия.Индекс(СтрокаМассива));	
	КонецЦикла;	
	
КонецПроцедуры

#КонецОбласти
